In [1]:
import pandas as pd

/Users/umeshregmi/miniconda3/lib/python3.10/site-packages/pandas/core/arrays/masked.py:60: UserWarning: Pandas requires version '1.3.6' or newer of 'bottleneck' (version '1.3.5' currently installed).
  from pandas.core import (

In [2]:
df = pd.read_csv('titanic.csv')

In [3]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [4]:
len(df.columns)

12

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [6]:
df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [7]:
df.Age.max()

80.0

In [8]:
df.Age.min()

0.42

In [9]:
df.Age.mean()

29.69911764705882

In [10]:
df.Age.median()

28.0

In [11]:
df.Age.std()

14.526497332334042

In [12]:
df.Age.var()

211.01912474630802

In [13]:
df.Age.describe()

count    714.000000
mean      29.699118
std       14.526497
min        0.420000
25%       20.125000
50%       28.000000
75%       38.000000
max       80.000000
Name: Age, dtype: float64

In [14]:
df.Age.agg('sum')

21205.17

In [15]:
df.Age.agg(['min', 'max', 'mean'])

min      0.420000
max     80.000000
mean    29.699118
Name: Age, dtype: float64

In [16]:
df.Age.idxmax()

630

In [17]:
df.rename(columns={'Sex':'Gender'}, inplace=True)

In [18]:
df.Age.isnull()

0      False
1      False
2      False
3      False
4      False
       ...
886    False
887    False
888     True
889    False
890    False
Name: Age, Length: 891, dtype: bool

In [19]:
df.isnull()

,PassengerId,Survived,Pclass,Name,Gender,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,False,False,False,False,False,False,False,False,False,False,True,False
1,False,False,False,False,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False,False,False,True,False
3,False,False,False,False,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False,False,False,True,False
...,...,...,...,...,...,...,...,...,...,...,...,...
886,False,False,False,False,False,False,False,False,False,False,True,False
887,False,False,False,False,False,False,False,False,False,False,False,False
888,False,False,False,False,False,True,False,False,False,False,True,False
889,False,False,False,False,False,False,False,False,False,False,False,False
890,False,False,False,False,False,False,False,False,False,False,True,False

In [20]:
True + True + True + False

3

In [21]:
df.Age.isnull().sum()

177

In [22]:
df.Age.isna().sum()

177

In [23]:
df.drop(0, inplace=True)

In [24]:
df

,PassengerId,Survived,Pclass,Name,Gender,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [25]:
df.drop('Name', axis=1, inplace=True)

In [26]:
df

,PassengerId,Survived,Pclass,Gender,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
1,2,1,1,female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,male,NaN,0,0,330877,8.4583,NaN,Q
...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,male,32.0,0,0,370376,7.7500,NaN,Q

In [27]:
df.drop(['Age', 'SibSp', 'Fare'], axis=1, inplace=True)

In [28]:
df.drop([1,2,3,4,5,6,7,8], inplace=True)

In [30]:
df.reset_index(inplace=True)

In [31]:
df

,index,PassengerId,Survived,Pclass,Gender,Parch,Ticket,Cabin,Embarked
0,9,10,1,2,female,0,237736,NaN,C
1,10,11,1,3,female,1,PP 9549,G6,S
2,11,12,1,1,female,0,113783,C103,S
3,12,13,0,3,male,0,A/5. 2151,NaN,S
4,13,14,0,3,male,5,347082,NaN,S
...,...,...,...,...,...,...,...,...,...
877,886,887,0,2,male,0,211536,NaN,S
878,887,888,1,1,female,0,112053,B42,S
879,888,889,0,3,female,2,W./C. 6607,NaN,S
880,889,890,1,1,male,0,111369,C148,C
881,890,891,0,3,male,0,370376,NaN,Q

In [33]:
df.iloc[[2]]

   index  PassengerId  Survived  Pclass  Gender  Parch  Ticket Cabin Embarked
2     11           12         1       1  female      0  113783  C103        S

In [34]:
df.iloc[[2,6,7]]

   index  PassengerId  Survived  Pclass  Gender  Parch  Ticket Cabin Embarked
2     11           12         1       1  female      0  113783  C103        S
6     15           16         1       2  female      0  248706   NaN        S
7     16           17         0       3    male      1  382652   NaN        Q

df[['Survived', 'Pclass']]

### read titanic data set
### print the number of rows and columns
### print the total number of elements in the dataframe
### pring the Age column in Series and also in dataframe
### print the highest and lowest age
### display only the row that has the highest age
### display descriptive stats of Fare Column
### print total numnber of na values in each columnn
### print total number of na values in Age column only
### print total number of non-na values in Age columnn
### select and print only the 2nd and 4th index row
### drop Name, PassengerId, SipSp, Parch, Cabin column permanently 
### print the info of the dataframe
### display the first 7 rows

In [39]:
df = pd.read_csv('titanic.csv')

In [40]:
len(df.columns)

12

In [41]:
len(df.index)

891

In [42]:
df.shape

(891, 12)

In [43]:
df.size

10692

In [44]:
df.Age

0      22.0
1      38.0
2      26.0
3      35.0
4      35.0
       ...
886    27.0
887    19.0
888     NaN
889    26.0
890    32.0
Name: Age, Length: 891, dtype: float64

In [45]:
df['Age']

0      22.0
1      38.0
2      26.0
3      35.0
4      35.0
       ...
886    27.0
887    19.0
888     NaN
889    26.0
890    32.0
Name: Age, Length: 891, dtype: float64

In [46]:
df[['Age']]

      Age
0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
..    ...
886  27.0
887  19.0
888   NaN
889  26.0
890  32.0

[891 rows x 1 columns]

In [47]:
df.Age.min()

0.42

In [48]:
df.Age.max()

80.0

In [49]:
df.Age.idxmax()

630

In [51]:
df.iloc[[df.Age.idxmax()]]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
630,631,1,1,"Barkworth, Mr. Algernon Henry Wilson",male,80.0,0,0,27042,30.0,A23,S

In [52]:
df.iloc[[df.Age.idxmin()]]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
803,804,1,3,"Thomas, Master. Assad Alexander",male,0.42,0,1,2625,8.5167,NaN,C

In [53]:
df.Fare.describe()

count    891.000000
mean      32.204208
std       49.693429
min        0.000000
25%        7.910400
50%       14.454200
75%       31.000000
max      512.329200
Name: Fare, dtype: float64

In [55]:
df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [56]:
df.count()

PassengerId    891
Survived       891
Pclass         891
Name           891
Sex            891
Age            714
SibSp          891
Parch          891
Ticket         891
Fare           891
Cabin          204
Embarked       889
dtype: int64

In [57]:
df.Age.isna().sum()

177

In [59]:
df.iloc[[1,3]]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S

In [61]:
df.drop(['Name', 'PassengerId', 'SibSp', 'Parch', 'Cabin'], axis=1, inplace=True)

In [62]:
df

     Survived  Pclass     Sex   Age            Ticket     Fare Embarked
0           0       3    male  22.0         A/5 21171   7.2500        S
1           1       1  female  38.0          PC 17599  71.2833        C
2           1       3  female  26.0  STON/O2. 3101282   7.9250        S
3           1       1  female  35.0            113803  53.1000        S
4           0       3    male  35.0            373450   8.0500        S
..        ...     ...     ...   ...               ...      ...      ...
886         0       2    male  27.0            211536  13.0000        S
887         1       1  female  19.0            112053  30.0000        S
888         0       3  female   NaN        W./C. 6607  23.4500        S
889         1       1    male  26.0            111369  30.0000        C
890         0       3    male  32.0            370376   7.7500        Q

[891 rows x 7 columns]

In [63]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 7 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Survived  891 non-null    int64
 1   Pclass    891 non-null    int64
 2   Sex       891 non-null    object
 3   Age       714 non-null    float64
 4   Ticket    891 non-null    object
 5   Fare      891 non-null    float64
 6   Embarked  889 non-null    object
dtypes: float64(2), int64(2), object(3)
memory usage: 48.9+ KB

In [64]:
df.head(7)

   Survived  Pclass     Sex   Age            Ticket     Fare Embarked
0         0       3    male  22.0         A/5 21171   7.2500        S
1         1       1  female  38.0          PC 17599  71.2833        C
2         1       3  female  26.0  STON/O2. 3101282   7.9250        S
3         1       1  female  35.0            113803  53.1000        S
4         0       3    male  35.0            373450   8.0500        S
5         0       3    male   NaN            330877   8.4583        Q
6         0       1    male  54.0             17463  51.8625        S